Tekla Open API Reference for Tekla Structures 2025
CustomLineType.LineDescription Property
 The description of the custom line type. Description uses the following format: List of line segments. Positive value gives length of filled line segment and negative value gives length of empty line segment. 0 means a dot.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<double> LineDescription { get; }
Public ReadOnly Property LineDescription As List(Of Double)
	Get
Property Value
Type: List<Double>
See Also
Reference
CustomLineType Class
Tekla.Structures.Drawing Namespace